<?php
  try 
  {
       $db = new PDO("mysql:host=localhost;dbname=trainDataBase", "root", "");    
      //$db->exec("use trainDataBase;");
      $ql2="CREATE TABLE IF NOT EXISTS trains(
      id int(50) NOT NULL AUTO_INCREMENT PRIMARY KEY,
      train_num int(50) NOT NULL,
      station varchar(225) NOT NULL,
      tim time default NULL,
      type varchar(225) NOT NULL,
      speed int(50) NOT NULL
      );";
      $db->exec($ql2);
                //   "INSERT INTO `trains` (`id`, `train_num`, `station`, `tim`, `type`, `speed`)"
                   /*  "INSERT INTO 'trains' ('id', 'train_num', 'station', 'tim', 'type', 'speed') VALUES (
                     NULL, '1', 'asyut', '03:00:00', 'vip', '15');" */
                     $db->exec("SET NAMES utf8");
    if( $db->exec( 
               "
               INSERT INTO `trains` (`id`, `train_num`, `station`, `tim`, `type`, `speed`) VALUES
                (1, 757, 'اسوان', '05:00:00', 'نوم', 125),
                (2, 757, 'القصر', '07:15:00', 'نوم', 125),
                (3, 757, 'سوهاج', '07:30:00', 'نوم', 125),
                (4, 757, 'اسيوط', '08:45:00', 'نوم', 125),
                (5, 757, 'المنيا', '09:50:00', 'نوم', 125),
                (6, 757, 'القاهره', '13:55:00', 'نوم', 125),
                (7, 858, 'اسوان', '07:00:00', 'نوم', 125),
                (8, 858, 'القصر', '09:15:00', 'نوم', 125),
                (9, 858, 'سوهاج', '09:30:00', 'نوم', 125),
                (10, 858, 'اسيوط', '10:45:00', 'نوم', 125),
                (11, 858, 'المنيا', '11:50:00', 'نوم', 125),
                (12, 858, 'القاهره', '15:55:00', 'نوم', 125),
                (13, 456, 'اسوان', '03:00:00', 'vip', 150),
                (14, 456, 'القصر', '04:15:00', 'vip', 150),
                (15, 456, 'سوهاج', '05:30:00', 'vip', 150),
                (16, 456, 'اسيوط', '06:45:00', 'vip', 150),
                (17, 456, 'المنيا', '07:50:00', 'vip', 150),
                (18, 456, 'القاهره', '11:55:00', 'vip', 150),
                (20, 789, 'القصر', '04:45:00', 'vip', 150),
                (21, 789, 'سوهاج', '06:00:00', 'vip', 150),
                (22, 789, 'اسيوط', '07:15:00', 'vip', 150),
                (23, 789, 'المنيا', '08:20:00', 'vip', 150),
                (24, 789, 'القاهره', '06:25:00', 'vip', 150),
                (25, 777, 'اسوان', '05:00:00', 'مكيف', 150),
                (26, 777, 'القصر', '05:35:00', 'مكيف', 150),
                (27, 777, 'ادفو', '06:00:00', 'مكيف', 150),
                (28, 777, 'سوهاج', '08:45:00', 'مكيف', 150),
                (29, 777, 'طما', '09:05:00', 'مكيف', 150),
                (30, 777, 'اسيوط', '09:35:00', 'مكيف', 150),
                (31, 777, 'صدفه', '10:00:00', 'مكيف', 150),
                (32, 777, 'المنيا', '11:00:00', 'مكيف', 150),
                (33, 777, 'القاهره', '16:55:00', 'مكيف', 150),
                (34, 888, 'اسوان', '06:00:00', 'مكيف', 150),
                (35, 888, 'القصر', '06:35:00', 'مكيف', 150),
                (36, 888, 'ادفو', '07:00:00', 'مكيف', 150),
                (37, 888, 'سوهاج', '09:45:00', 'مكيف', 150),
                (38, 888, 'طما', '10:05:00', 'مكيف', 150),
                (39, 888, 'اسيوط', '10:35:00', 'مكيف', 150),
                (40, 888, 'صدفه', '11:00:00', 'مكيف', 150),
                (41, 888, 'المنيا', '12:00:00', 'مكيف', 150),
                (42, 888, 'القاهره', '17:55:00', 'مكيف', 150),
                (43, 101, 'اسوان', '07:00:00', 'ركاب', 105),
                (44, 101, 'القصر', '07:30:00', 'ركاب', 105),
                (45, 101, 'ادفو', '08:00:00', 'ركاب', 105),
                (46, 101, 'سوهاج', '09:00:00', 'ركاب', 105),
                (47, 101, 'طما', '09:30:00', 'ركاب', 105),
                (48, 101, 'اسيوط', '10:00:00', 'ركاب', 105),
                (49, 202, 'اسوان', '09:00:00', 'ركاب', 105),
                (50, 202, 'القصر', '09:30:00', 'ركاب', 105),
                (51, 202, 'ادفو', '10:00:00', 'ركاب', 105),
                (52, 202, 'سوهاج', '11:00:00', 'ركاب', 105),
                (53, 202, 'طما', '11:30:00', 'ركاب', 105),
                (54, 202, 'اسيوط', '12:00:00', 'ركاب', 105),
                (55, 202, 'المنيا', '14:30:00', 'ركاب', 105),
                (56, 202, 'القاهره', '20:30:00', 'ركاب', 105),
                (57, 101, 'المنيا', '12:30:00', 'ركاب', 105),
                (58, 101, 'القاهره', '06:30:00', 'ركاب', 105);") ) echo "test"; 
     //INSERT INTO `trains` (`id`, `train_num`, `station`, `tim`, `type`, `speed`)                        VALUES (NULL, '1', 'asyut', '03:00:00', 'vip', '15');"
  } 
    catch (PDOException $e) {
        die("DB ERROR: ". $e->getMessage());
    }


?>

